Repository: share-extras/langpack-cy
Catalog: core/tmx/web-client.tmx
Source language: en_us
Languages: cy

source: The broken links check failed at {0} due to the error:
cy: Methwyd y gwiriad cysylltiadau toredig am {0} oherwydd y gwall:

source: Document Details
cy: Manylion Dogfen

source: No description set.
cy: Dim disgrifiad wedi gosod.

source: Test Server
cy: Gweinydd Profi

source: Two Column Narrow Right
cy: Dau Colofn Ochr De Cul

source: Part of Workflow
cy: Rhan o Lif Gwaith

source: Allow Versioning
cy: Caniatáu Fersiynu

source: Email Action
cy: Gweithred Anfon E-bost

source: Step One - Select Actions
cy: Cam Un - Dewis Gweithredoedd

source: Successfully changed Inherit Parent Permissions to 'Yes'
cy: Newidiwyd Etifeddu Caniatadau Rhiant i 'Ie' yn llwyddiannus

source: Property ''{0}'' is not available for this node
cy: Nid yw'r priodwedd "{0}" ar gael i'r Nôd yma

source: Are you sure you want to delete "{0}" and all previous editions? Each translation will be deleted too.
cy: A ydych chi'n siŵr eich bod eisiau dileu "{0}" a phob argraffiad blaenorol? Mi fydd pob cyfieithiad yn cael ei dileu hefyd.

source: To remove this layered folder, click OK.
cy: I waredu'r ffolder haenol yma, cliciwch Iawn.

source: To undo the changes to all the files in the sandbox, click OK.
cy: I ddadwneud pob newidiad i ffeiliau yn y blwch tywod, cliciwch Iawn.

source: HTTP Request Parameters
cy: Paramedrau Cais HTTP

source: Unable to find form {0}.
cy: Methu canfod y ffurflen {0}.

source: Review Sandbox
cy: Blwch Tywod Adolygu

source: Unable to navigate to the item as it cannot be read by this user. Another user may have modified the permission.
cy: Methu llywio i'r eitem oherwydd ni ellir y defnyddiwr yma ei ddarllen. Efallai bod defnyddiwr arall wedi newid y caniatadau.

source: Step Three - Configure Deployment Servers
cy: Cam Tri - Ffurfweddu Gweinyddion Darpariaeth

source: Select a category
cy: Dewis categori

source: Select user/group and their role(s)
cy: Dewis defnyddiwr/grŵp a'i rol(au)

source: copied
cy: wedi copïo

source: Port must contain a number.
cy: Rhaid i'r porth fod yn rhif.

source: Successfully created space ''{0}''.
cy: Crëwyd y lle "{0}" yn llwyddiannus.

source: Run import in background
cy: Rhedeg mewnforiant yn y cefndir

source: View Deployments
cy: Gweld Darpariaethau

source: Deploy Snapshot
cy: Darparu Ciplun

source: Search does not exist with name: "{0}"
cy: Nid yw chwiliad gyda'r enw yn bodoli: "{0}"

source: Content Type
cy: Math Cynnwys

source: Select
cy: Dewis

source: Create Web Form Wizard
cy: Dewin Creu Ffurflen Gwe

source: Advanced Search
cy: Chwiliad Uwch

source: Approve Flow
cy: Llif Cymeradwyo

source: Notify the selected users.
cy: Hysbysu'r defnyddwyr dewiswyd.

source: {0} is a mandatory field.
cy: Mae {0} yn maes angenrheidiol

source: XML Content
cy: Cynnwys XML

source: Import Action
cy: Gweithred Mewnforio

source: Change User Roles
cy: Newid Rolau Defnyddiwr

source: Rendition Details
cy: Manylion Lluniad

source: Edit File Properties
cy: Golygu Priodweddau Ffeil

source: Add translation when this dialog closes.
cy: Ychwanegwch cyfieithiad pan fo'r deialog yma yn cau.

source: Create User
cy: Creu Defnyddiwr

source: An unknown error occurred during the link validation check
cy: Digwyddodd gwall anhysbys yn ystod y gwiriad dilysu cysylltiadau

source: A Space or File with that name already exists: {0}
cy: Mae Lle neu Ffeil gyda'r enw yna yn bodoli eisoes: {0}

source: Remove
cy: Tynnu

source: To delete this Group from the system and remove all members from it, click Delete.
cy: I ddileu'r grŵp yma o'r system a thynnu pob defnyddiwr ohono, cliciwch Dileu.

source: Monitor Deployment
cy: Monitro Darpariaeth

source: Step One - Starting item
cy: Cam Un - Eitem Cychwyn

source: Close Search
cy: Cau'r Chwiliad

source: Are you sure you want to remove "{0}", "{1}", and its {2} other associated {2,choice,0#renditions|1#rendition|1<renditions} from the sandbox?
cy: A ydych chi'n siŵr eich bod eisiau tynnu "{0}", "{1}", a'i {2} {2,choice,0#lluniadau|1#lluniad|1<lluniadau} cysylltiedig arall o'r blwch tywod?

source: Inline Editable
cy: Golygadwy Mewn-lein

source: Folder
cy: Ffolder

source: Preview
cy: Rhagolygu

source: Delete File
cy: Dileu Ffeil

source: Folder Type
cy: Math Ffolder

source: The space just selected is no longer in the repository, please Refresh the Navigator before continuing.
cy: Ni ellir canfod y lle sydd newydd ei ddewis yn y repositori. Ail-lwythwch y Llywiwr cyn parhau, os gwelwch yn dda.

source: Delete Forum
cy: Dileu Fforwm

source: Change Details
cy: Newid Manylion

source: Choose how you want to create your space.
cy: Dewiswch sut ydych eisiau creu eich lle.

source: Create Forum Space
cy: Creu Lle Fforwm

source: Script Action
cy: Gweithred Sgript

source: Folder Properties
cy: Priodweddau Ffolder

source: Configure the workflow defaults for this Web Project
cy: Ffurfweddwch y rhagosodiadau llif gwaith ar gyfer y Project Gwe yma.

source: Edit the information for this category.
cy: Golygu'r manylion ar gyfer y gategori yma.

source: Feature Tour
cy: Taith Nodweddion

source: Specify details for the new rendering engine template
cy: Mewnbynnwch manylion y templed peiriant llunio newydd

source: Excludes
cy: Gwaharddiadau

source: Users and their Roles
cy: Defnyddwyr a Rolau

source: Finished
cy: Gorffennwyd

source: Select a test server to deploy to and click OK. This server will then be allocated to this sandbox.
cy: Dewiswch gweinydd profi a chliciwch Iawn. Bydd y gweinydd wedyn yn cael ei dyrannu i'r blwch tywod.

source: Components
cy: Cydrannau

source: Rules
cy: Rheolau

source: The item "{0}" has been successfully recovered.
cy: Mae'r eitem "{0}" wedi ei adfer yn llwyddiannus.

source: Configure Templates
cy: Ffurfweddu Templedi

source: Posted
cy: Postio

source: Set the category for the document then click OK.
cy: Gosodwch y categori ar gyfer y ddogfen a chliciwch Iawn.

source: Loading
cy: Llwytho

source: Edit the content of the document, then click Save.
cy: Golygwch cynnwys y ddogfen, a chliciwch Cadw.

source: Set the category for the space then click OK.
cy: Gosodwch y categori ar gyfer y ffolder a chliciwch Iawn.

source: Check In File
cy: Gwirio i Fewn Ffeil

source: This wizard helps you to create a new document in a space.
cy: Mae'r dewin yma yn eich cynorthwyo i creu dogfen newydd tu fewn lle.

source: Remove All
cy: Tynnu Pob Un

source: Alfresco Web Client - Login
cy: Dibynnydd Gwe Alfresco - Mewngofnodi

source: Step Two - Notify Users
cy: Cam Dau - Hysbysu Defnyddwyr

source: Without content (just translation information)
cy: Heb cynnwys (gwybodaeth cyfieithiad yn unig)

source: Has Aspect Condition
cy: Amod Efo Agwedd

source: Delete Post
cy: Dileu Post

source: Review Options
cy: Dewisiadau Adolygiad

source: Cannot view details of the target document as you do not have the required permissions.
cy: Methu gweld manylion y ddogfen targed oherwydd nad oes gennych y caniatadau angenrheidiol.

source: Must specify username and password.
cy: Rhaid penodi enw defnyddiwr a chyfrinair.

source: Plain Text Content
cy: Cynnwys Testun Plaen

source: Edit Web Project Settings
cy: Golygu Gosodiadau Project Gwe

source: Apply To All
cy: Rhoi i Bob

source: Select an action...
cy: Dewis gweithred...

source: Language
cy: Iaith

source: This layout display components in two columns with a narrow left hand column
cy: Mae'r cynllun yma yn arddangos cydrannau mewn dau colofn gyda colofn ochr chwith cul

source: Template Name
cy: Enw Templed

source: View details about the folder.
cy: Gweld manylion y ffolder.

source: Failed to save search due to error: {0}
cy: Methwyd cadw'r chwiliad oherwydd gwall: {0}

source: Create a Web Project based on an existing one. The Staging Sandbox structure, Web Forms, Workflow and Users will be copied from the selected Web Project
cy: Creu Project Gwe yn seiliedig ar un cyfredol. Bydd y strwythur Blwch Tywod Llwyfo, Ffurflenni Gwe, Llif Gwaith a Defnyddwyr yn cael eu gopïo i'r Project Gwe dewiswyd

source: This layout displays components across three columns of equal width
cy: Mae'r cynllun yma yn arddangos cydrannau mewn tri colofn o lled cyfartal

source: Modify translation properties when this wizard finishes.
cy: Newid priodweddau cyfieithiad pan fo'r dewin yma yn cau.

source: View deployment details for each of the servers selected in the last deployment.
cy: Gwelwch manylion ar gyfer pob un o'r gweinyddion dewiswyd yn y ddarpariaeth olaf.

source: No permissions to write
cy: Heb caniatâd i ysgrifennu

source: Password can only contain characters or digits.
cy: Dim ond llythrennau a rhifau gall y cyfrinair cynnwys

source: Pivot translation
cy: Cyfieithiad colyn

source: Version
cy: Fersiwn

source: Current
cy: Presennol

source: Create Layered Folder
cy: Creu Ffolder Haenog

source: Expires
cy: Yn Darfod

source: Successfully submitted selected items for user: {0}
cy: Cyflwynwyd yr eitemau dewiswyd ar gyfer y defnyddiwr {0} yn llwyddiannus

source: Choose the content item you want to create the new edition.
cy: Dewiswch yr eitem cynnwys a hoffech creu y argraffiad newydd.

source: Failed to apply the ''classifiable'' aspect to the document due to system error: {0}
cy: Methwyd gosod yr agwedd "classifiable" i'r ddogfen oherwydd gwall system: {0}

source: Modify the link object properties then click OK.
cy: Golygwch priodweddau y gwrthrych cyswllt, a chliciwch Iawn.

source: Successfully reverted sandbox ''{0}'' to version: {1}
cy: Dychwelwyd y blwch tywod "{0}" i fersiwn {1} yn llwyddiannus

source: Item is specialised to type ''{0}''
cy: Eitem wedi ei arbenigo i fath "{0}"

source: Notes
cy: Nodiadau

source: Add Translation Without Content
cy: Ychwanegu Cyfieithiad Heb Gynnwys

source: Search failed due to system error: {0}
cy: Methwyd y chwiliad oherwydd gwall system: {0}

source: Enter information about the new Group then click Create Group.
cy: Mewnbynnwch gwybodaeth am y Grŵp newydd a chliciwch Creu Grŵp.

source: This wizard helps you run an action
cy: Mae'r dewin yma yn eich cynorthwyo i rhedeg gweithred

source: Recent Spaces
cy: Lleoedd Diweddar

source: Delete Space
cy: Dileu Lle

source: Update
cy: Diweddaru

source: Enter the text pattern required, including any wildcards. The file name includes the file type extension when matching.
cy: Mewnbynnwch eich patrwm testun, yn cynnwys unrhyw nodau nodchwiliwr. Mae'r enw y ffeil yn cynnwys unrhyw estyniad math ffeil wrth cydweddu.

source: Select Renditions
cy: Dewis Lluniadau

source: Using a template
cy: Defnyddio templed

source: Notify the invited users.
cy: Hysbysu'r defnyddwyr sydd wedi eu wahodd.

source: Make this document multilingual
cy: Gwneud y ddogfen yma yn amlieithog

source: Look in location
cy: Edrychwch yn y lleoliad

source: Navigate to your home space. In the space info area, click Create Content under Create and enter information about the content to be created.
cy: Llywio i'ch lle cartref. Yn yr ardal gwybodaeth lle, cliciwch Creu Cynnwys o dan Creu a mewnbynnwch gwybodaeth am y gynnwys i greu.

source: Allows tree based navigation around the repository
cy: Yn caniatáu llywio coeden o gwmpas y repositori

source: complete
cy: wedi cwblhau

source: Cancel
cy: Diddymu

source: Remove User
cy: Gwaredu Defnyddiwr

source: Unlock
cy: Datgloi

source: Failed to find the link validation report, this is probably due to the report being too large, please lower the 'maxNumberLinksInReport' setting.
cy: Methwyd canfod yr adroddiad dilysu cysylltiadau, mwy na thebyg oherwydd fod yr adroddiad yn rhy fawr. Leihau'r gosodiad 'maxNumberLinksInReport', os gwelwch yn dda.

source: To remove this file from the sandbox, click OK.
cy: I tynnu'r ffeil yma o'r blwch tywod, cliciwch Iawn.

source: Company Home
cy: Cartref Cwmni

source: Local
cy: Lleol

source: Select a workflow
cy: Dewiswch llif gwaith

source: Browse Page URL
cy: Cyfeiriad Pori Tudalen

source: Create Webapp Folder
cy: Creu Ffolder Cymhwysiad Gwe

source: Unable to check in Content Node due to system error:
cy: Methu gwirio i fewn y Nôd Cynnwys oherwydd gwall system:

source: Are you sure you want to cancel the "{0}" workflow?
cy: A ydych chi'n siŵr eich bod eisiau diddymu y llif gwaith "{0}"?

source: Bubble View
cy: Golwg Swigen

source: Click OK to deploy any changes in the sandbox to your allocated test server.
cy: Cliciwch Iawn i ddarparu unrhyw newidiadau yn y blwch tywod i'ch gweinydd profi a neilltuwyd.

source: Reset
cy: Ailosod

source: Edition Notes
cy: Nodiadau Argraffiad

source: HTTP Application State
cy: Cyflwr Cymhwysiad HTTP

source: Search
cy: Chwilio

source: Transform this document as a multilingual document.
cy: Trawsffurfio y ddogfen fel ddogfen amlieithog.

source: Check Out File Download
cy: Lawrlwythiad Gwirio Allan Ffeil

source: There {0,choice,0#are no users|1#is one user|1<are {0,number} users} working on this web project.
cy: {0,choice,0#Nid oes unrhyw defnyddwyr|1#Mae un defnyddiwr|1<Mae {0,number} defnyddwyr} yn gweithio ar y project gwe yma.

source: Starting item
cy: Eitem Cychwyn

source: Recovered Items Report
cy: Adroddiad Eitemau a Adferwyd

source: Content Expiration
cy: Darfod Cynnwys

source: This schema does not contain any element declarations. A schema must contain at least one element declaration in order to generate a form.
cy: Nid oes gan y sgema yma unrhyw datganiadau elfen. Rhaid i sgema cynnwys ar leiaf un datganiad elfen er mwyn cynhyrchu ffurflen.

source: Date
cy: Dyddiad

source: Add content to your home space
cy: Ychwanegwch cynnwys i'ch lle cartref

source: Unable to find the repository item referenced by Id: {0} - the record has probably been deleted from the database.
cy: Methu canfod yr eitem a gyfeiriwyd gan Id: {0} - mae'n tebyg bod y record wedi ei ddileu o'r cronfa ddata.

source: Show me results in the categories
cy: Dangos i mi canlyniadau yn y categorïau

source: Deleted
cy: Wedi'i Dileu

source: When you have finished editing the copy you need to check it in to release the lock and allow others to work with the modified document.
cy: Pan ydych wedi gorffen golygu y copi rhaid i chi gwirio fo i fewn er mwyn rhyddhau y clo a gadael i bobl arall gweithio gyda'r dogfen a newidiwyd.

source: Show
cy: Dangos

source: This wizard helps you to create a new content item for a website.
cy: Mae'r dewin yma yn eich cynorthwyo i greu eitem cynnwys newydd ar gyfer safle gwe.

source: LIVE
cy: FYW

source: User Properties
cy: Priodweddau Defnyddiwr

source: More Actions
cy: Mwy o Gweithredoedd

source: HTTP Request State
cy: Cyflwr Cais HTTP

source: Content Language Filter
cy: Hidl Iaith Cynnwys

source: Content Reviewer
cy: Adolygydd Cynnwys

source: Change Expiration Date
cy: Newid Dyddiad Darfod

source: Preview Website
cy: Rhagolygu Safle Gwe

source: Select required feature
cy: Dewiswch nodwedd sydd angen

source: Continue working
cy: Parhau gweithio

source: Choose space icon
cy: Dewis eicon lle

source: Snapshot Properties
cy: Priodweddau Ciplun

source: Allow Inline Editing
cy: Caniatáu Golygu Mewn-lein

source: Has Mimetype Condition
cy: Amod Efo Math MIME

source: Add to List
cy: Ychwanegu i'r Rhestr

source: Roles
cy: Rolau

source: Preview in Template
cy: Rhagolygu mewn Templed

source: Recover Listed Items
cy: Adfer Eitemau Rhestredig

source: Edit details of the File System Receiver
cy: Golygu manylion y Derbyniwr System Ffeil

source: HTML Content
cy: Cynnwys HTML

source: Are you sure you want to delete the post from "{0}"?
cy: A ydych chi'n siŵr eich bod eisiau dileu'r hysbysiad o "{0}"?

source: All Items
cy: Pob Eitem

source: Complete Repository
cy: Repositori Cyfan

source: Review Status
cy: Statws Adolygiad

source: Folder Space
cy: Lle Ffolder

source: Permanently delete the listed files and spaces from the deleted file store
cy: Dileu am byth y ffeiliau a ffolderau a restrir o'r stôr ffeiliau wedi'u dileu

source: Add User to Group
cy: Ychwanegu Defnyddiwr i Grŵp

source: Preview Folder
cy: Rhagolygu Ffolder

source: e.g.
cy: e.e.

source: Post Reply
cy: Postio Ateb

source: Destination
cy: Cyrchfan

source: Deployed To
cy: Wedi Darparu i

source: This document is not categorized.
cy: Nid yw'r dogfen wedi categoreiddio.

source: Modify Properties of Simple Workflow
cy: Newid Priodweddau Llif Gwaith Syml

source: Recount
cy: Ailgyfri

source: Report Summary
cy: Crynodeb Adroddiad

source: Failed to apply the ''classifiable'' aspect to the space due to system error: {0}
cy: Methwyd gosod yr agwedd "classifiable" i'r lle oherwydd gwall system: {0}

source: Previous Item
cy: Eitem Blaenorol

source: Browse Sandbox
cy: Pori Blwch Tywod

source: Configure this view and build your personal Alfresco dashboard
cy: Ffurfweddwch y golwg yma i adeiladu eich gwibfwrdd Alfresco personol

source: Select items
cy: Dewis Eitemau

source: To release the test server from this sandbox, click Yes.
cy: I rhyddhau'r gweinydd profi o'r blwch tywod yma, cliciwch Iawn.

source: This wizard helps you regenerate renditions.
cy: Mae'r dewin yma yn eich cynorthwyo i ail-gynhyrchu lluniadau.

source: Export From
cy: Allforio O

source: No icons found
cy: Heb ganfod eiconau

source: Browse Spaces
cy: Pori Lleoedd

source: Export
cy: Allforio

source: Root Groups
cy: Grwpiau Gwreiddiol

source: Failed to apply the ''versionable'' aspect to the document due to system error: {0}
cy: Methwyd gosod yr agwedd "versionable" i'r ddogfen oherwydd gwall system: {0}

source: Assign To
cy: Neilltuo I

source: Submit
cy: Cyflwyno

source: Three Column
cy: Tri-Colofn

source: Yesterday
cy: Ddoe

source: Login
cy: Mewngofnodi

source: My Tasks To Do
cy: Fy Nhasgau i'w-Wneud

source: To create the forum click Create Forum.
cy: I greu'r fforwm cliciwch Creu Fforwm.

source: View
cy: Golwg

source: Invite All users as guests
cy: Gwahodd pob defnyddiwr fel gwesteion

source: Alfresco Node Browser
cy: Porwr Nôd Alfresco

source: View the details about the versioned content.
cy: Gweld manylion am y cynnwys fersiynnol.

source: To save the dashboard configuration click Finish. To review or change your selections click Back.
cy: I cadw gosodiad y gwibfwrdd cliciwch Gorffen. I adolygu neu newid eich dewisiadau cliciwch Nôl.

source: Form {0} associated with {1} is not configured for web project {2}.
cy: Nid yw'r ffurflen {0} sydd wedi cysylltu gyda {1} wedi'i ffurfweddu ar gyfer y project gwe {2}.

source: Change your Content Language to view or edit text in different languages.
cy: Newidiwch eich Iaith Cynnwys i gweld neu olygu cynnwys mewn ieithoedd eraill.

source: Change User Password
cy: Newid Cyfrinair Defnyddiwr

source: Default Workflow
cy: Llif Gwaith Rhagosodedig

source: To continue click Next.
cy: I barhau cliciwch Nesaf

source: To remove this folder and its contents from the sandbox, click OK.
cy: I dynnu'r ffolder yma a'i gynnwys o'r blwch tywod, cliciwch Iawn.

source: Edit the checked out file, undo the check out or carry on working.
cy: Golygu'r ffeil sydd wedi ei gwirio allan, dadwnewch neu gariwch ymlaen gweithio.

source: Delete Item
cy: Dileu Eitem

source: Two Column Narrow Left
cy: Dau Colofn Ochr Chwith Cul

source: Delete Group
cy: Dileu Grŵp

source: You will have the role of: {0}
cy: Bydd gennych y rôl: {0}

source: Children
cy: Plant

source: This space does not yet have any categories applied.
cy: Nid oes gan y lle unrhyw categori eto.

source: You can not import an empty ACP file!
cy: Ni allwch chi mewnforio ffeil ACP gwag!

source: Create Content
cy: Creu Cynnwys

source: No messages.
cy: Dim negeseuon.

source: Enter information about the new edition.
cy: Mewnbynnwch gwybodaeth am y argraffiad newydd.

source: User
cy: Defnyddiwr

source: Modify categories of
cy: Newid categorïau

source: Click Add
cy: Cliciwch Ychwanegu

source: Step Two - Select Actions
cy: Cam Dau - Dewiswch Gweithredoedd

source: To remove this rule from the space, click Yes.
cy: I gwaredu'r rheol o'r lle, cliciwch Ie.

source: View Discussions
cy: Gweld Trafodaeth

source: Launch Date
cy: Dyddiad Lansio

source: Please correct the errors below then click Create Space.
cy: Cywirwch y wallau isod a chliciwch Creu Lle, os gwelwch yn dda.

source: Web Project
cy: Project Gwe

source: No tasks found.
cy: Heb ganfod unrhyw tasgau

source: Common Tasks
cy: Tasgau Cyffredin

source: Are you sure you want to remove the layered folder "{0}" from this sandbox, this will also remove the folder and it's contents from all user sandboxes in this webproject?
cy: A ydych chi'n siŵr eich bod eisiau dileu'r ffolder haenol "{0}" o'r blwch tywod yma? Mi fydd hyn yn tynnu'r ffolder a'i gynnwys o phob blwch tywod defnyddiwr yn y project gwe yma.

source: Click to set a date
cy: Cliciwch i osod dyddiad

source: Submission Info
cy: Gwybodaeth Cyflwyniad

source: This layout display components in two columns with a narrow right hand column
cy: Mae'r cynllun yma yn arddangos cydrannau mewn dau colofn gyda colofn ochr de cul

source: To edit {0} using the selected Web Form, click ok. If {0} is not a Web Form generated asset and should be treated as regular content, click cancel.
cy: I olygu {0} gyda'r Ffurflen Gwe dewiswyd cliciwch Iawn. Os nad yw {0} yn ased a gynhyrchwyd gan Ffurflen Gwe a ddylid trin fel cynnwys arferol, cliciwch Diddymu.

source: Content Format
cy: Fformat Cynnwys

source: A system error happened during the operation: {0}
cy: Digwyddodd gwall system yn ystod y weithrediad: {0}

source: First Name
cy: Enw Cyntaf

source: Node Browser
cy: Porwr Nodau

source: No categories selected.
cy: Dim categorïau wedi'u ddewis

source: Copy Action
cy: Gweithred Copïo

source: Check Out of
cy: Gwirio Allan o

source: PARTIAL FAILURE
cy: METHIANT RHANNOL

source: Displays a 3 column thumbnail list of the images in my home space
cy: Dangosir rhestr rhagolygon cryno tri-colofn o'r delweddau yn fy lle cartref

source: Interface Language
cy: Iaith Rhyngwyneb

source: If you undo the check out of a document, the associated working copy will be deleted and all changes to it since the Check Out will be lost.
cy: Os dadwneir y gwiriad allan o ddogfen, bydd y copi gweithio cysylltiedig yn cael ei ddileu a bydd pob newidiad i'r eitem ers wneud y gwiriad allan yn cael eu golli.

source: Save Search Query
cy: Cadw Ymholiad Chwilio

source: Step one, edit the detail of the new edition
cy: Cam un, golygu manylion yr argraffiad newydd

source: Add User
cy: Ychwanegu Defnyddiwr

source: Add Translation
cy: Ychwanegu Cyfieithiad

source: Are you sure you want to permanently delete "{0}" from the deleted file store? The item cannot be recovered once this action has been performed.
cy: A ydych chi'n siŵr eich bod eisiau dileu "{0}" o'r stôr ffeiliau wedi'u dileu am byth? Ni allir adfer yr eitem ar ôl berfformio'r gweithred yma.

source: Show Details
cy: Dangos Manylion

source: Advanced Workflows
cy: Llifiau Gwaith Uwch

source: Step Two - Configure Templates
cy: Cam Dau - Ffurfweddu Templedi

source: Select Workflows
cy: Dewiswch Llifiau Gwaith

source: Edit the details of Web Form {0} in Web Project {1}.
cy: Golygwch manylion y Ffurflen Gwe {0} yn y Project Gwe {1}.

source: All Languages
cy: Pob Iaith

source: Move Action
cy: Gweithred Symud

source: Links
cy: Cysylltiadau

source: Choose this option to regenerate all renditions of all form generated content within the selected web project.
cy: Dewiswch y dewisiad yma i ail-gynhyrchu pob lluniad o gynnwys a gynhyrchwyd gan ffurflenni yn y project gwe dewiswyd.

source: Auto Deploy
cy: Hunan Darparu

source: Edition Properties
cy: Priodweddau Argraffiad

source: Name for approve step
cy: Enw i'r cam cymeradwyo

source: Reset Config Service
cy: Ailosod Gwasanaeth Ffurfweddu

source: Cut
cy: Torri

source: Click the help icon to display Alfresco Help topics.
cy: Cliciwch yr eicon cymorth i arddangos y pynciau Cymorth Alfresco.

source: Created from Web Project
cy: Creu o Broject Gwe
